#Задача 26:  Посчитать факториал (произведение 1 до N) и треугольное число (сумма чисел от 1 до N) для числа N ЧЕРЕЗ РЕКУРСИЮ и без циклов

#def factorial(n):
#    if (n <= 1):
#        return 1
#    else:
#        return (n * factorial(n - 1))
    
#def triangularNumber(n):
#    if (n == 1):
#        return 1
#    else:
#        return triangularNumber(n - 1) + n
#n = int(input("Введите число: "))
#print("Факториал числа равен: ")
#print(factorial(n))
#print("Треугольное число равно: ")
#print(triangularNumber(n))