#Задача 18: Требуется найти в массиве A[N] самый близкий по величине элемент к заданному числу X.
#Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
#В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
#Ввод: 5
#Ввод: 1 2 6 4 9
#Ввод: 8
#-> 9

#n = int(input("Введите размер элементов массива: "))
#list_n = input("Введите элементы массива через пробел:").split()
#arr = list(map(int, list_n))
#x = int(input("Введите число x: "))
#min = x - arr[0]
#index = 0
#for i in range(1, n):
#    count = x - arr[i]
#    if count < min:
#        min = count
#        index = i
#print(f"Число {arr[index]} в массиве А самый близкий по величине элемент к заданному числу {x}")
