#Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[N].
#Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
#В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
#Ввод: 5
#Ввод: 3 2 3 7 5
#Ввод: 3
#-> 2

#n = int(input("Введите размер элементов массива: "))
#list_n = input("Введите элементы массива через пробел:").split()
#arr = list(map(int, list_n))
#x = int(input("Введите число x: "))
#count = 0
#for i in range(n):
#    if arr[i] == x:
#        count += 1
#print(f"Число {x} встречается в массиве A {count} раз(а).")